# Wave Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
Wave Class
Members See Also
---
A static class that provides access to the property names that appear in the Wave visual asset schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static class Wave
```

Visual Basic
---
```text
Public NotInheritable Class Wave
```

Visual C++
---
```text
public ref class Wave abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Visual..::..Wave
# See Also
Wave Members
Autodesk.Revit.DB.Visual Namespace